#!/usr/bin/env python
# coding: utf-8

# # Вступ до машинного навчання
# Лабораторна робота №1
# 
# Виконав: студент групи ІТ-ЗП01 Косенко Антон
#     
#     Завдання: Аналіз реалізації лінійної регресії
#     
#     Короткий опис роботи: для аналізу реалізації лінійної регресії було взято набір данних, що містить інформацію про зміну середньої річної температури у світі за період з 1880 року - до 2016 року.
#      
#     При виконанні роботи використано мову програмування python, середовище розробки jupyter notebook. Для роботи з даними та розрахунків використано бібліотеки numpy, pandas та sklearn, а для візуалізації та побудови графіків бібліотеку matplotlib. 

# # Порядок виконання роботи:

# 1) Підключимо необхідні для роботи бібліотеки:

# In[5]:


import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

from sklearn.linear_model import LinearRegression


# 2) імпортуємо набір данних та виведемо інформацію про нього:

# In[6]:


data = pd.read_csv("AverageTemperatureChanges.csv")
data


# 3) Переглянемо основні характеристики даних з нашого набору:

# In[7]:


data.describe()


# 4) Виконаємо візуалізацію набору данних на графіку, використавши бібліотеку matplotlib:

# In[8]:


plt.scatter(data.Year, data.Mean) #виберемо вид графіку у вигляді точок на площині, осі X присвоїмо значення з колонки "Years"
#осі Y присвоїмо значення з колонки "Mean"

#присвоїмо назви осям 
plt.xlabel('Years') 
plt.ylabel('Average temperature cahges') 
#встановимо межі значень в яких будемо досліджувати дані
plt.ylim(-1, 2)
plt.xlim(1880, 2040)


# 5) побудуємо модель Лінійної регресії:

# In[9]:


model = LinearRegression() #створимо об'єкт моделі Лінійної регресії


# In[10]:


#створимо змінні X та Y яким передамо дані з відповідних колонок
X = pd.DataFrame(data.Year) #дані на підставі яких буде здійснюватися передбачення
y = pd.DataFrame(data.Mean) #дані які будемо передбачати


# In[11]:


#виконаємо навчання моделі передавши параметри X та y
model.fit(X, y)


# In[12]:


model.coef_ #визначимо коефіцієнт нахилу прямої


# In[13]:


#6) візуалізуємо побудовану модель:


# In[14]:


#побудуємо графік
plt.scatter(data.Year, data.Mean)
plt.show()

#побудуємо пряму лінійної регресії на нашому графіку
plt.plot(X, model.predict(X), color = "red", linewidth = 2)

plt.xlabel('Years')
plt.ylabel('Average temperature cahges')
plt.ylim(-1, 2)
plt.xlim(1880, 2040)
plt.show()


# 7) Підрахуємо точність побудованої моделі:

# In[15]:


model.score(X, y)


# Висновки: 
# В результаті виконання лабораторної роботи було проведено аналіз побудови лінійної регресії на наборі данних про зміни середньої річної температури за час протягом якого ведуться метеорологічні спостереження.
# В результаті було побудовано модель, яка демонструє точність 0,75, що є непоганим показником враховуючи тип моделі - Лінійну регресію та зміни темпу збільшення середньої річної температури в останні два десятиліття.
